<center><h1>Краткая информация</h1> 
    <p>В данном проекте реализовано:</p><br>
1. Страница регистрации и авторизации пользователя, после регистрации на почту приходит ссылка для подтверждения пользователя.<br>
2. Реализована отправка сообщений между пользователями (выбор адресата для сообщения выбирается из выпадающего списка).<br>
3. Если диалог с пользователем уже начат, то есть возможность отправить ему сообщение напрямую из диалога.<br>
4. При появлении нового сообщения приходит уведомление на почту пользователя.<br>
5. Предусмотрена рассылку сообщений по всем пользователям (в выпадающем списке есть вариант "Все пользователи").<br>
6. Создан интерфейс администратора, который может:<br>
 - просматривать, удалять, добавлять сообщения диалогов между произвольными пользователями;<br>
 - добавлять, удалять, редактировать пользователей.<br>
7. Каждый пользователь может создать свой собственный черный список, чтобы не получать сообщений от людей, который ему не интересны.<br>
8. Пользователь имеет возможность просматривать все беседы, которые он когда-то вел.<br>
9. Пользователь может создать групповой чат или присоединиться к любому, уже созданному, чату.<br>



</center>